class ObesityBreedMapper:
    breed_mapping = {
        "그레이하운드": 0, "달마시안": 1, "닥스훈트": 2, "도베르만": 3, "골든 리트리버": 4, 
        "래브라도 리트리버": 5, "말티즈": 6, "불독": 7, "비글": 8, "비숑 프리제": 9, 
        "셰퍼드": 10, "슈나우저": 11, "드리": 12, "웰시코기": 13, "저먼 셰퍼드": 14, 
        "진도견": 15, "차우차우": 16, "차우차우 숏": 17, "코카 스파니엘": 18, "테리어": 19, 
        "포메라니안": 20, "푸들": 21, "하운드": 22, "허스키": 23, "믹스견": 24, 
        "밀란견": 25, "미스틱견": 26, "코리아견": 27, "러시안 블루": 28, "페르시안": 29, 
        "샴": 30, "터키시 앙고라": 31, "스코티쉬 폴드": 32, "믹스": 33, "기타": 34
    }

    # 한글 품종을 숫자 코드로 변환하는 함수
    @staticmethod
    def get_breed_code(korean_breed):
        breed_code = ObesityBreedMapper.breed_mapping.get(korean_breed, -1)  # 없는 품종은 -1로 처리
        return breed_code
